rofiqcp/Praktikum-Sistem-Embedded/Modul-02-Interrupt-Timer/praktikum/STM32/STM32_12_NVIC_Priority/src/main.c
/* ============================================================
 *  STM32_12 — NVIC Priority Demo
 *  PB0 (EXTI0) — high priority  (preempt=0, sub=0) → fast blink PA0
 *  PB1 (EXTI1) — low  priority  (preempt=2, sub=0) → slow blink PA1
 *  NVIC_PRIORITYGROUP_4 (4 bits preemption, 0 bits sub-priority)
 *  ISRs set flags; main loop processes and blinks LEDs.
 * ============================================================ */

#include "config.h"
#include <stdio.h>
#include <string.h>

/* ---- Peripheral handles ---- */
UART_HandleTypeDef huart1;

/* ---- ISR flags ---- */
volatile uint8_t high_prio_flag = 0;
volatile uint8_t low_prio_flag  = 0;
volatile uint32_t high_count    = 0;
volatile uint32_t low_count     = 0;

/* ---- Prototypes ---- */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
void Error_Handler(void);

/* ---- printf redirect ---- */
int _write(int file, char *ptr, int len) {
    HAL_UART_Transmit(&huart1, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* ============================ main ============================ */
int main(void)
{
    HAL_Init();

    /* Set priority grouping BEFORE any NVIC calls */
    HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);

    SystemClock_Config();
    MX_GPIO_Init();
    MX_USART1_UART_Init();

    printf("\r\n=== STM32 NVIC Priority Demo ===\r\n");
    printf("PB0 = HIGH priority (preempt 0) → LED PA0 fast blink\r\n");
    printf("PB1 = LOW  priority (preempt 2) → LED PA1 slow blink\r\n\r\n");

    while (1) {
        /* High-priority button → fast blink PA0 */
        if (high_prio_flag) {
            high_count++;
            printf("[HIGH prio] Button press #%lu — fast blink\r\n", high_count);
            for (int i = 0; i < 10; i++) {
                HAL_GPIO_TogglePin(LED1_PORT, LED1_PIN);
                HAL_Delay(50);
            }
            HAL_GPIO_WritePin(LED1_PORT, LED1_PIN, GPIO_PIN_RESET);
            high_prio_flag = 0;
        }

        /* Low-priority button → slow blink PA1 */
        if (low_prio_flag) {
            low_count++;
            printf("[LOW  prio] Button press #%lu — slow blink\r\n", low_count);
            for (int i = 0; i < 6; i++) {
                HAL_GPIO_TogglePin(LED2_PORT, LED2_PIN);
                HAL_Delay(200);
            }
            HAL_GPIO_WritePin(LED2_PORT, LED2_PIN, GPIO_PIN_RESET);
            low_prio_flag = 0;
        }

        HAL_Delay(10);
    }
}

/* ================= EXTI callbacks & IRQs ===================== */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == BTN_HIGH_PIN) {
        high_prio_flag = 1;
    } else if (GPIO_Pin == BTN_LOW_PIN) {
        low_prio_flag = 1;
    }
}

void EXTI0_IRQHandler(void)
{
    HAL_GPIO_EXTI_IRQHandler(BTN_HIGH_PIN);
}

void EXTI1_IRQHandler(void)
{
    HAL_GPIO_EXTI_IRQHandler(BTN_LOW_PIN);
}

/* ===================== GPIO Init ============================= */
static void MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

#ifdef STM32F103xB
    __HAL_RCC_AFIO_CLK_ENABLE();
#else
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif

    /* ----- LEDs PA0, PA1 — output push-pull ----- */
    GPIO_InitStruct.Pin   = LED1_PIN | LED2_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
#if defined(STM32F401xC) || defined(STM32F411xE)
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
#endif
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* ----- BTN_HIGH — PB0, EXTI0 falling edge, pull-up ----- */
    GPIO_InitStruct.Pin  = BTN_HIGH_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BTN_HIGH_PORT, &GPIO_InitStruct);

    /* ----- BTN_LOW — PB1, EXTI1 falling edge, pull-up ----- */
    GPIO_InitStruct.Pin  = BTN_LOW_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BTN_LOW_PORT, &GPIO_InitStruct);

    /* ----- NVIC — different preemption priorities ----- */
    HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);   /* highest */
    HAL_NVIC_EnableIRQ(EXTI0_IRQn);

    HAL_NVIC_SetPriority(EXTI1_IRQn, 2, 0);   /* lower   */
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
}

/* ===================== USART1 Init =========================== */
static void MX_USART1_UART_Init(void)
{
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

#ifdef STM32F103xB
    GPIO_InitStruct.Pin   = GPIO_PIN_9;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin  = GPIO_PIN_10;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
#else
    GPIO_InitStruct.Pin       = GPIO_PIN_9 | GPIO_PIN_10;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
#endif

    huart1.Instance          = USART1;
    huart1.Init.BaudRate     = 115200;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart1) != HAL_OK) Error_Handler();
}

/* =================== System Clock Config ===================== */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

#ifdef STM32F103xB
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) Error_Handler();

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) Error_Handler();
#else
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM       = 25;
    RCC_OscInitStruct.PLL.PLLN       = 336;
    RCC_OscInitStruct.PLL.PLLP       = RCC_PLLP_DIV4;
    RCC_OscInitStruct.PLL.PLLQ       = 7;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) Error_Handler();

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) Error_Handler();
#endif
}

/* ==================== Error Handler ========================== */
void Error_Handler(void)
{
    __disable_irq();
    while (1) { }
}
